lib_app/app/controllers/libraries_controller.rb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @library = Library.find_by_id(params[:id])

INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "GA Library"], ["floor_count", 100], ["floor_area", 50], ["created_at", 2016-08-16 20:54:54 UTC], ["updated_at", 2016-08-16 20:54:54 UTC]]
---
  def create
    @library = Library.create(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    library_id = params[:id]
    @library = Library.find_by_id(library_id)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "libraries" SET "name" = $1, "floor_count" = $2, "floor_area" = $3, "updated_at" = $4 WHERE "libraries"."id" = $5  [["name", "GA Library SF"], ["floor_count", 101], ["floor_area", 51], ["updated_at", 2016-08-16 21:24:16 UTC], ["id", 1]]
---
  def update
    library_id = params[:id]
    @library = Library.find_by_id(library_id)
    @library.update_attributes(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 1]]
---
  def destroy
    library_id = params[:id]
    @library = Library.find_by_id(library_id)
    @library.destroy