lib_app/app/controllers/library_users_controller.rb

  def create
    @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]